{
    "classes": [
        "VERB", "VARIETY", "METHODS",
        "BEVERAGE","PRODUCT","PERSON",
        "QUANTITY","NORP","TIME",
        "PERSON","CATEGORY","LOC",
        "NATIONALITY","COUNTRY","CITY",
        "DATE","TECHNIQUE","CONTINENT"
    ],
    "annotations": [
        [
            "\r",
            {
                "entities": []
            }
        ],
        [
            "Coffee is one of the most consumed beverages globally. Coffee ranks third, following water and tea. Before reaching your cup, coffee is a significant agricultural crop. Coffee provides livelihoods for millions of people worldwide. Coffee is a seed protected in a fruit. There are different processes to extract the seed. The process used affects its taste. Coffee is harvested annually. Coffee varies each year, similar to wine. Environmental conditions affect coffee growth. Coffee is not easy to grow. Coffee is not easy to harvest and process.\r",
            {
                "entities": [
                    [
                        0,
                        6,
                        "PRODUCT"
                    ],
                    [
                        26,
                        34,
                        "VERB"
                    ],
                    [
                        55,
                        61,
                        "PRODUCT"
                    ],
                    [
                        85,
                        90,
                        "PRODUCT"
                    ],
                    [
                        95,
                        99,
                        "PRODUCT"
                    ],
                    [
                        126,
                        132,
                        "PRODUCT"
                    ],
                    [
                        176,
                        184,
                        "VERB"
                    ],
                    [
                        231,
                        237,
                        "PRODUCT"
                    ],
                    [
                        248,
                        257,
                        "VERB"
                    ],
                    [
                        263,
                        269,
                        "PRODUCT"
                    ],
                    [
                        290,
                        299,
                        "VERB"
                    ],
                    [
                        315,
                        320,
                        "PRODUCT"
                    ],
                    [
                        325,
                        332,
                        "VERB"
                    ],
                    [
                        367,
                        376,
                        "VERB"
                    ],
                    [
                        387,
                        393,
                        "PRODUCT"
                    ],
                    [
                        423,
                        428,
                        "PRODUCT"
                    ],
                    [
                        454,
                        460,
                        "VERB"
                    ],
                    [
                        461,
                        467,
                        "PRODUCT"
                    ],
                    [
                        468,
                        475,
                        "VERB"
                    ],
                    [
                        476,
                        482,
                        "PRODUCT"
                    ],
                    [
                        504,
                        510,
                        "PRODUCT"
                    ],
                    [
                        526,
                        533,
                        "VERB"
                    ],
                    [
                        538,
                        545,
                        "VERB"
                    ]
                ]
            }
        ],
        [
            "\r",
            {
                "entities": []
            }
        ],
        [
            "There are two types of coffee crops: Arabica represents about 70 percent of what is grown and consumed worldwide. Arabica is difficult to grow because it needs elevation and is easily impacted by insects and disease. Even with perfect conditions, the yield with Arabica is limited. Arabica has the best taste, with unrivaled complexities and flavors. Robusta has a greater yield per tree than Arabica. Robusta isn't as susceptible to insects or disease. Robusta grows at any elevation. However, Robusta is known for its harsh taste characteristics. Even though a significant quantity is grown, processed, and consumed, Robusta isn't considered specialty or gourmet.\r",
            {
                "entities": [
                    [
                        23,
                        29,
                        "PRODUCT"
                    ],
                    [
                        37,
                        44,
                        "VARIETY"
                    ],
                    [
                        84,
                        89,
                        "VERB"
                    ],
                    [
                        94,
                        102,
                        "VERB"
                    ],
                    [
                        114,
                        121,
                        "VARIETY"
                    ],
                    [
                        138,
                        142,
                        "VERB"
                    ],
                    [
                        184,
                        192,
                        "VERB"
                    ],
                    [
                        262,
                        269,
                        "VARIETY"
                    ],
                    [
                        282,
                        289,
                        "VARIETY"
                    ],
                    [
                        351,
                        358,
                        "VARIETY"
                    ],
                    [
                        393,
                        401,
                        "VARIETY"
                    ],
                    [
                        402,
                        409,
                        "VARIETY"
                    ],
                    [
                        454,
                        461,
                        "VARIETY"
                    ],
                    [
                        462,
                        467,
                        "VERB"
                    ],
                    [
                        495,
                        502,
                        "VARIETY"
                    ],
                    [
                        587,
                        592,
                        "VERB"
                    ],
                    [
                        594,
                        603,
                        "VERB"
                    ],
                    [
                        609,
                        617,
                        "VERB"
                    ],
                    [
                        619,
                        626,
                        "VARIETY"
                    ]
                ]
            }
        ],
        [
            "\r",
            {
                "entities": []
            }
        ],
        [
            "The cherry is picked every year. The cherry produces seeds. Most fruits have two seeds. Sometimes, a fruit has a peaberry, which is a single seed. Many decisions about growing determine how trees are raised. The decisions about growing trees are influenced by practices, water availability, and technology. The decisions about growing trees affect how fruits are collected and coffee beans handled. The decisions that affect how fruits are collected and coffee beans handled influence the taste of coffee for consumers.\r",
            {
                "entities": [
                    [
                        4,
                        10,
                        "PRODUCT"
                    ],
                    [
                        14,
                        20,
                        "VERB"
                    ],
                    [
                        37,
                        43,
                        "PRODUCT"
                    ],
                    [
                        44,
                        52,
                        "VERB"
                    ],
                    [
                        53,
                        59,
                        "PRODUCT"
                    ],
                    [
                        65,
                        71,
                        "PRODUCT"
                    ],
                    [
                        81,
                        87,
                        "PRODUCT"
                    ],
                    [
                        101,
                        106,
                        "PRODUCT"
                    ],
                    [
                        113,
                        121,
                        "PRODUCT"
                    ],
                    [
                        141,
                        146,
                        "PRODUCT"
                    ],
                    [
                        168,
                        175,
                        "VERB"
                    ],
                    [
                        190,
                        195,
                        "PRODUCT"
                    ],
                    [
                        200,
                        207,
                        "VERB"
                    ],
                    [
                        228,
                        235,
                        "VERB"
                    ],
                    [
                        236,
                        241,
                        "PRODUCT"
                    ],
                    [
                        246,
                        256,
                        "VERB"
                    ],
                    [
                        271,
                        276,
                        "PRODUCT"
                    ],
                    [
                        327,
                        334,
                        "VERB"
                    ],
                    [
                        335,
                        340,
                        "PRODUCT"
                    ],
                    [
                        341,
                        347,
                        "VERB"
                    ],
                    [
                        352,
                        358,
                        "PRODUCT"
                    ],
                    [
                        377,
                        389,
                        "PRODUCT"
                    ],
                    [
                        418,
                        424,
                        "VERB"
                    ],
                    [
                        429,
                        435,
                        "PRODUCT"
                    ],
                    [
                        454,
                        466,
                        "PRODUCT"
                    ],
                    [
                        498,
                        504,
                        "PRODUCT"
                    ]
                ]
            }
        ],
        [
            "\r",
            {
                "entities": []
            }
        ],
        [
            "Coffee in modern times started with a vision and a dream in the late 1960s. A transition happened involving a small group of entrepreneurs. A small group of entrepreneurs took a different approach, focusing on origin, quality, craft roasting, and taste. These aspects became fundamental to their coffee work. The journey of coffee, like many entrepreneurial ventures, blends art and science. Roasting coffee is central to and represents this journey.\r",
            {
                "entities": [
                    [
                        0,
                        6,
                        "PRODUCT"
                    ],
                    [
                        23,
                        30,
                        "VERB"
                    ],
                    [
                        89,
                        97,
                        "VERB"
                    ],
                    [
                        171,
                        175,
                        "VERB"
                    ],
                    [
                        268,
                        274,
                        "VERB"
                    ],
                    [
                        324,
                        330,
                        "PRODUCT"
                    ]
                ]
            }
        ],
        [
            "\r",
            {
                "entities": []
            }
        ],
        [
            "Almost perfect coffee-growing climate and vast land made South America a prime spot for cultivating a relatively new crop all the way back in the 1700s. South America is home to Brazil and Colombia, the top coffee producers in the world for annual production. South American countries known for coffee production are:\r",
            {
                "entities": [
                    [
                        88,
                        99,
                        "VERB"
                    ],
                    [
                        207,
                        223,
                        "PERSON"
                    ],
                    [
                        285,
                        290,
                        "VERB"
                    ],
                    [
                        295,
                        301,
                        "PRODUCT"
                    ]
                ]
            }
        ],
        [
            "\r",
            {
                "entities": []
            }
        ],
        [
            "Bolivia: The Yungas forest in the Andes Mountains is home to some strikingly beautiful, high-elevation coffee farms. Despite Bolivia having a past reputation for lower-quality output, the industry is watching and waiting to see what the future holds.\r",
            {
                "entities": [
                    [
                        200,
                        208,
                        "VERB"
                    ],
                    [
                        213,
                        220,
                        "VERB"
                    ]
                ]
            }
        ],
        [
            "Brazil: The largest coffee producer hasn’t always been the best, but Brazil has focused on fine-tuning its crops; some prodigious infrastructure efforts and a significant goal to be a top premium coffee source have spurred a resurgence.\r",
            {
                "entities": [
                    [
                        20,
                        35,
                        "PERSON"
                    ],
                    [
                        188,
                        202,
                        "PRODUCT"
                    ]
                ]
            }
        ],
        [
            "Colombia: Thanks to stellar marketing and some beautiful coffees, Colombia is thought by many to be “the most coffee” of coffees when it comes to flavor in the cup.\r",
            {
                "entities": [
                    [
                        78,
                        85,
                        "VERB"
                    ],
                    [
                        110,
                        117,
                        "PRODUCT"
                    ],
                    [
                        121,
                        128,
                        "PRODUCT"
                    ]
                ]
            }
        ],
        [
            "Ecuador: Small farms in the Andes are producing limited quantities, but there’s currently hope for infrastructure investment, because coffee in Ecuador has considerable potential.\r",
            {
                "entities": [
                    [
                        38,
                        47,
                        "VERB"
                    ],
                    [
                        134,
                        140,
                        "PRODUCT"
                    ]
                ]
            }
        ],
        [
            "Peru: A diversity of growing regions in this country has resulted in a wide variety of intriguing flavor profiles.\r",
            {
                "entities": [
                    [
                        21,
                        28,
                        "VERB"
                    ],
                    [
                        57,
                        65,
                        "VERB"
                    ]
                ]
            }
        ],
        [
            "Venezuela: At one time, Venezuela had a coffee output that was comparable to its high-production neighbors. However, Venezuela’s diminishing output has really taken away from the country’s coffee exports, and so most of the interesting and good-quality crop is consumed in the country.",
            {
                "entities": [
                    [
                        40,
                        46,
                        "PRODUCT"
                    ],
                    [
                        129,
                        140,
                        "VERB"
                    ],
                    [
                        224,
                        235,
                        "VERB"
                    ],
                    [
                        261,
                        269,
                        "VERB"
                    ]
                ]
            }
        ],
        [
            "These islands have a history and heritage in coffee. It has striking mountainous regions and is situated perfectly in the tropical climate of the equatorial belt. Three islands are in the Caribbean Sea and one island is in the Pacific Ocean. All islands continue to have tremendous potential and some considerable pedigree as coffee growing origins, such as Cuba, Dominician Republic, Hawaii, and Jamaica.\r",
            {
                "entities": [
                    [
                        14,
                        18,
                        "VERB"
                    ],
                    [
                        45,
                        52,
                        "PRODUCT"
                    ],
                    [
                        60,
                        68,
                        "VERB"
                    ],
                    [
                        96,
                        104,
                        "VERB"
                    ],
                    [
                        254,
                        262,
                        "VERB"
                    ],
                    [
                        266,
                        270,
                        "VERB"
                    ]
                ]
            }
        ],
        [
            "Cuba has been growing coffee since the mid-18th century. The political situation has all but eliminated any output from it. It is a coffee growing environment with true potential. The Dominican Republic has a long-established history of coffee farming. It has recognized potential for investment and renewed effort. Hawaii hosts some of the most beautiful coffee farms. It celebrates production of some of the most favored and pricey coffees in the world. Jamaica is home to the famed Blue Mountains. They are located in the eastern third of the island. Coffee farms have a heritage that dates back to 1723 and French King Louis XV. French King Louis sent three plants as a gift to Martinique. Five years later, the governor of Martinique gave one of those as a gift to Jamaica’s governor.\r",
            {
                "entities": [
                    [
                        22,
                        28,
                        "PRODUCT"
                    ],
                    [
                        93,
                        103,
                        "VERB"
                    ],
                    [
                        203,
                        206,
                        "VERB"
                    ],
                    [
                        260,
                        270,
                        "VERB"
                    ],
                    [
                        300,
                        307,
                        "VERB"
                    ],
                    [
                        323,
                        328,
                        "VERB"
                    ],
                    [
                        373,
                        383,
                        "VERB"
                    ],
                    [
                        434,
                        441,
                        "PRODUCT"
                    ],
                    [
                        510,
                        517,
                        "VERB"
                    ],
                    [
                        567,
                        571,
                        "VERB"
                    ],
                    [
                        588,
                        593,
                        "VERB"
                    ],
                    [
                        651,
                        655,
                        "VERB"
                    ],
                    [
                        739,
                        743,
                        "VERB"
                    ]
                ]
            }
        ],
        [
            "Africa is home to the birthplace of coffee, and centuries later, it has some of the most powerful stories of human perseverance and resilience. Africa today is an important frontier for innovation and growth in the coffee industry.\r",
            {
                "entities": [
                    [
                        36,
                        42,
                        "PRODUCT"
                    ],
                    [
                        68,
                        71,
                        "VERB"
                    ]
                ]
            }
        ],
        [
            "The Great Rift Valley, Mt. Kenya, and the Ethiopian Plateau establish splendid geography for coffee production in Ethiopia and Kenya:\r",
            {
                "entities": [
                    [
                        4,
                        21,
                        "LOCATION"
                    ],
                    [
                        60,
                        69,
                        "VERB"
                    ]
                ]
            }
        ],
        [
            "Ethiopia: Ethiopia, the birthplace of coffee, has a long-standing culture centered on coffee. Ethiopian coffees are some of the most exotic in the world.\r",
            {
                "entities": [
                    [
                        38,
                        44,
                        "PRODUCT"
                    ],
                    [
                        46,
                        49,
                        "VERB"
                    ],
                    [
                        74,
                        82,
                        "VERB"
                    ]
                ]
            }
        ],

        [
            "Kenya: Kenya, although not the largest in output among African coffee countries, is recognized and celebrated for its unusual and often high-quality coffees with unique flavor characteristics.\r",
            {
                "entities": [
                    [
                        84,
                        94,
                        "VERB"
                    ],
                    [
                        99,
                        109,
                        "VERB"
                    ],
                    [
                        149,
                        156,
                        "PRODUCT"
                    ]
                ]
            }
        ],
        [
            "Southern Africa has countries. Development and innovation are alive in those countries. Burundi has an on-again, off-again approach. It impacts Burundi’s coffee consistency. This small country is often the source of some unique offerings. Congo has some refreshingly bright and flavorful coffees. Malawi has experienced turbulence. It is linked to political instability. Despite that, this country has been able to export some tasty coffees. They have found their way to consumers in Europe and the United States. Rwanda is highly respected. It is for their response to the tragedy of genocide in the 1990s. The ensuing focus on coffee is a key to a brighter, more prosperous future. Rwandan coffee growers have established a reputation. They are for producing some terrific coffees. Mount Kilimanjaro and Mount Meru are home to some highly regarded coffee farms. Coffee plays an important role in Tanzania’s economy. Zambia is a small country. It has a growing interest in expanding its coffee industry. Zambia is another country with potential. It is one to be watched.\r",
            {
                "entities": [
                    [
                        16,
                        19,
                        "VERB"
                    ],
                    [
                        96,
                        99,
                        "VERB"
                    ],
                    [
                        136,
                        143,
                        "VERB"
                    ],
                    [
                        144,
                        160,
                        "PRODUCT"
                    ],
                    [
                        245,
                        248,
                        "VERB"
                    ],
                    [
                        308,
                        319,
                        "VERB"
                    ],
                    [
                        338,
                        344,
                        "VERB"
                    ],
                    [
                        415,
                        421,
                        "VERB"
                    ],
                    [
                        452,
                        457,
                        "VERB"
                    ],
                    [
                        612,
                        619,
                        "VERB"
                    ],
                    [
                        712,
                        723,
                        "VERB"
                    ],
                    [
                        751,
                        760,
                        "VERB"
                    ],
                    [
                        841,
                        849,
                        "VERB"
                    ],
                    [
                        871,
                        876,
                        "VERB"
                    ],
                    [
                        948,
                        951,
                        "VERB"
                    ],
                    [
                        974,
                        983,
                        "VERB"
                    ],
                    [
                        1063,
                        1070,
                        "VERB"
                    ]
                ]
            }
        ],
        [
            "The region known as the Asia Pacific is the most remote and exotic environment for growing coffee are China, India, Indonesia, Papua New Guinea, Vietnam, and Yemen.\r",
            {
                "entities": [
                    [
                        83,
                        90,
                        "VERB"
                    ]
                ]
            }
        ],
        [
            "China started coffee production in the late 1980s in the Yunnan Region. Green coffee buyers recognize it as having huge potential. India has a long history of producing both coffee and tea. It is a significant source of both beverages. Some islands in Indonesia have a respected place in the world of coffee. Coffee is an important export for Papua New Guinea. The industry started in the early 1920s with coffee seeds imported from the Jamaican Blue Mountains. Vietnam is the second-largest coffee producer globally. It has made progress in establishing itself as a source for quality coffee exports. Yemen has a long history with coffee dating back to the 6th century. It is known for its variety called Mocha and the Arabian Port of Mokha. They contribute to some of the greatest coffees sourced from there.",
            {
                "entities": [
                    [
                        6,
                        13,
                        "VERB"
                    ],
                    [
                        92,
                        101,
                        "VERB"
                    ],
                    [
                        108,
                        114,
                        "VERB"
                    ],
                    [
                        137,
                        140,
                        "VERB"
                    ],
                    [
                        159,
                        168,
                        "VERB"
                    ],
                    [
                        174,
                        180,
                        "PRODUCT"
                    ],
                    [
                        185,
                        189,
                        "PRODUCT"
                    ],
                    [
                        262,
                        266,
                        "VERB"
                    ],
                    [
                        301,
                        308,
                        "PRODUCT"
                    ],
                    [
                        309,
                        315,
                        "PRODUCT"
                    ],
                    [
                        374,
                        381,
                        "VERB"
                    ],
                    [
                        406,
                        418,
                        "PRODUCT"
                    ],
                    [
                        419,
                        427,
                        "VERB"
                    ],
                    [
                        525,
                        529,
                        "VERB"
                    ],
                    [
                        542,
                        554,
                        "VERB"
                    ],
                    [
                        608,
                        611,
                        "VERB"
                    ],
                    [
                        677,
                        682,
                        "VERB"
                    ],
                    [
                        706,
                        711,
                        "VARIETY"
                    ],
                    [
                        720,
                        742,
                        "VARIETY"
                    ],
                    [
                        748,
                        758,
                        "VERB"
                    ],
                    [
                        791,
                        798,
                        "VERB"
                    ]
                ]
            }
        ],
        [
            "In the past century, roasting has seen incredible technical advances. Someone realized long ago that roasting the coffee seed created a flavorful beverage. The industry around coffee roasting took some time to develop. Tossing a few beans in a frying pan over an open fire is how coffee roasting began. Interim change was driven by speed, efficiency, and quantity. Finally, a focus on using the art and science for the best tastes has prevailed.",
            {
                "entities": [
                    [
                        30,
                        38,
                        "VERB"
                    ],
                    [
                        78,
                        86,
                        "VERB"
                    ],
                    [
                        114,
                        125,
                        "PRODUCT"
                    ],
                    [
                        126,
                        133,
                        "VERB"
                    ],
                    [
                        192,
                        196,
                        "VERB"
                    ],
                    [
                        219,
                        226,
                        "VERB"
                    ],
                    [
                        296,
                        302,
                        "VERB"
                    ],
                    [
                        318,
                        328,
                        "VERB"
                    ],
                    [
                        431,
                        444,
                        "VERB"
                    ]
                ]
            }
        ],
        [
            "Coffee roasting transforms green coffee seeds. Roasters heat the seeds until they turn brown. This process combines art and science to influence the flavor of the coffee. Early roasters focused on speed and cost. They adjusted temperature to roast beans quickly, using less fuel and saving time. The rise of specialty coffee changed this focus. Roasters now prioritize flavor, using roasting time and temperature to achieve specific taste profiles. Great flavor is the ultimate goal, so there's no single right or wrong way to roast. The entire process takes just minutes, but within that short time, roasters make many decisions. They rely on experience, a love for the craft, and scientific knowledge to navigate this delicate roasting process.",
            {
                "entities": [
                    [
                        16,
                        26,
                        "VERB"
                    ],
                    [
                        27,
                        46,
                        "PRODUCT"
                    ],
                    [
                        47,
                        55,
                        "PERSON"
                    ],
                    [
                        56,
                        60,
                        "VERB"
                    ],
                    [
                        107,
                        115,
                        "VERB"
                    ],
                    [
                        135,
                        144,
                        "VERB"
                    ],
                    [
                        163,
                        170,
                        "PRODUCT"
                    ],
                    [
                        177,
                        185,
                        "PERSON"
                    ],
                    [
                        186,
                        193,
                        "VERB"
                    ],
                    [
                        218,
                        226,
                        "VERB"
                    ],
                    [
                        242,
                        247,
                        "VERB"
                    ],
                    [
                        318,
                        324,
                        "PRODUCT"
                    ],
                    [
                        325,
                        332,
                        "VERB"
                    ],
                    [
                        345,
                        353,
                        "PERSON"
                    ],
                    [
                        416,
                        423,
                        "VERB"
                    ],
                    [
                        553,
                        558,
                        "VERB"
                    ],
                    [
                        601,
                        609,
                        "PERSON"
                    ],
                    [
                        610,
                        614,
                        "VERB"
                    ],
                    [
                        636,
                        640,
                        "VERB"
                    ],
                    [
                        658,
                        662,
                        "VERB"
                    ],
                    [
                        706,
                        714,
                        "VERB"
                    ]
                ]
            }
        ],
        [
            "Coffee is brewed in various ways. Cupping is the industry standard for assessing coffee. Cupping refers to a brewing method where precisely ground coffee is placed in contact with hot water, and extraction happens. After a carefully measured brew time, the grounds have sunk in the bowl or cup, and a cupper tastes it. French press is perhaps the first sophisticated brewing method, and it is an extremely popular way to brew coffee. Drip coffee is the most ubiquitous method because you encounter it everywhere you get coffee. Drip-coffee brewing depends on gravity and a filter to deliver the end result.",
            {
                "entities": [
                    [
                        0,
                        6,
                        "PRODUCT"
                    ],
                    [
                        10,
                        16,
                        "VERB"
                    ],
                    [
                        34,
                        41,
                        "METHODS"
                    ],
                    [
                        71,
                        80,
                        "VERB"
                    ],
                    [
                        89,
                        96,
                        "METHODS"
                    ],
                    [
                        97,
                        103,
                        "VERB"
                    ],
                    [
                        147,
                        153,
                        "PRODUCT"
                    ],
                    [
                        157,
                        163,
                        "VERB"
                    ],
                    [
                        206,
                        214,
                        "VERB"
                    ],
                    [
                        265,
                        274,
                        "VERB"
                    ],
                    [
                        301,
                        307,
                        "PERSON"
                    ],
                    [
                        308,
                        314,
                        "VERB"
                    ],
                    [
                        319,
                        331,
                        "METHODS"
                    ],
                    [
                        434,
                        445,
                        "METHODS"
                    ],
                    [
                        488,
                        497,
                        "VERB"
                    ],
                    [
                        528,
                        539,
                        "METHODS"
                    ],
                    [
                        548,
                        555,
                        "VERB"
                    ],
                    [
                        583,
                        590,
                        "VERB"
                    ]
                ]
            }
        ],
        [
            "In the early 1900s, Italy developed a groundbreaking brewing method that changed coffee forever. Espresso, a strong black coffee, is made by forcing hot water through ground coffee using pressure. Here are some basics:Espresso started for speed. It's made using specialized equipment to produce a concentrated shot, usually 1–2 ounces. The espresso world offers unique and famous drinks and recipes.",
            {
                "entities": [
                    [
                        26,
                        35,
                        "VERB"
                    ],
                    [
                        73,
                        80,
                        "VERB"
                    ],
                    [
                        81,
                        87,
                        "PRODUCT"
                    ],
                    [
                        97,
                        105,
                        "METHODS"
                    ],
                    [
                        122,
                        128,
                        "PRODUCT"
                    ],
                    [
                        133,
                        137,
                        "VERB"
                    ],
                    [
                        141,
                        148,
                        "VERB"
                    ],
                    [
                        181,
                        186,
                        "VERB"
                    ],
                    [
                        218,
                        226,
                        "METHODS"
                    ],
                    [
                        227,
                        234,
                        "VERB"
                    ],
                    [
                        251,
                        255,
                        "VERB"
                    ],
                    [
                        287,
                        294,
                        "VERB"
                    ],
                    [
                        324,
                        335,
                        "QUANTITY"
                    ],
                    [
                        340,
                        348,
                        "METHODS"
                    ],
                    [
                        355,
                        361,
                        "VERB"
                    ]
                ]
            }
        ],
        [
            "\r",
            {
                "entities": []
            }
        ],
        [
            "Coffee was first grown in an area informally called the Coffee Belt. The birthplace of coffee is Africa, Ethiopia specifically. Robusta, discovered much later in the 19th century by botanists in Central and West Africa. \r",
            {
                "entities":[
                    [0,6,"PRODUCT"],[17,22,"VERB"],[56,68,"LOC"],[87,93,"PRODUCT"],[97,103,"CONTINENT"],[105,113,"COUNTRY"],[128,135,"PRODUCT"],[137,147,"VERB"],[166,178,"DATE"],[182,191,"PERSON"],[195,219,"CONTINENT"]
                ]
            }
        ],
        [
            "\r",
            {
                "entities": []
            }
        ],
        [
            "The Ethiopians cultivated coffee for hundreds of years. Yemeni traders began exporting coffee to Persia, Egypt, and the Ottoman Empire. Arabian physician first wrote about coffee sometime in the 10th century.\r",{"entities":[[4,14,"NATIONALITY"],[15,25,"VERB"],[26,32,"PRODUCT"],[56,62,"NATIONALITY"],[77,86,"VERB"],[87,93,"PRODUCT"],[97,103,"COUNTRY"],[105,110,"COUNTRY"],[116,135,"COUNTRY"],[136,153,"PERSON"],[160,165,"VERB"],[172,178,"PRODUCT"],[195,207,"DATE"]]}],["\r",{"entities":[]}],["South America had an almost perfect climate for growing coffee. The vast land made it a prime spot for cultivating a relatively new crop. This happened back in the 1700s. Cuba has been growing coffee since the mid-18th century. Coffee dates back to the 6th century in Yemen. An amazing technological advancement in brewing developed in Italy in the early 1900s.",{"entities":[[0,13,"CONTINENT"],[48,55,"VERB"],[56,63,"PRODUCT"],[103,114,"VERB"],[164,170,"DATE"],[171,175,"COUNTRY"],[185,192,"VERB"],[193,199,"PRODUCT"],[210,227,"DATE"],[253,264,"DATE"],[268,274,"COUNTRY"],[315,322,"TECHNIQUE"],[323,332,"VERB"],[336,341,"COUNTRY"],[349,360,"DATE"]]}]
    ]
}